#1. Напишите программу, которая принимает на вход вещественное число
#  и показывает сумму его цифр.
num = float(input("Введите вещественное число "))
res = 0
for i in str(num):
    if i.isdigit():
        res = res + int(i)
print(res)
