#4. Задайте список из N элементов, заполненных числами 
# из промежутка [-N, N]. Найдите произведение элементов на 
# указанных позициях. Позиции хранятся в файле file.txt в одной строке
# одно число.(для продвинутых - с файлом, вариант минимум 
# - ввести позиции в консоли)
num = int(input("Введите число "))
lst = list(range(-num, num + 1))
indices = list(map(int, input("Введите индексы ").split()))
res = 1
for i in indices:
    res = res * lst[i]
print(res)
